# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Apps
cask '1password'
cask 'docker'
cask 'figma'
cask 'iterm2'
cask 'google-chrome'
cask 'phpstorm'
cask 'tableplus'
cask 'postman'
cask 'spotify'
cask 'the-unarchiver'
cask 'openemu';

# Fonts
cask 'font-jetbrains-mono';

# Mac App Store
mas 'Twitter', id: 1482454543
mas 'WhatsApp', id: 1147396723
